app/controllers/api/movies_controller.rb

  def search
        query_string = params[:query_string]

        if query_string.length == 0
            render json: {}
        else
            query_string = query_string.chars.map{|char| char.downcase}.join
            @movies = Movie.with_attached_thumbnail
                .where('LOWER(title) LIKE ?', '%' + query_string + '%')

            if @movies.empty?
---
SELECT  "movies".* FROM "movies" ORDER BY "movies"."id" ASC LIMIT $1  [["LIMIT", 1]]