app/models/user.rb

  def reset_session_token!
    self.session_token = SecureRandom.urlsafe_base64
    self.save!
---
UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "uwj3IIlxPm9sZxns1ixnsA"], ["updated_at", "2021-03-18 17:43:01.459170"], ["id", 2]]